In [12]:
import os, urllib
import pandas as pd
import pyodbc
from sqlalchemy import create_engine

In [25]:
# This is what makes the magic functions work:

%load_ext sql

# %%sql to create a multi-line sql block that outputs a dataframe
# %sql to execute a single line of sql that can go straight into a python variable.
# Be sure to install the ipython-sql for this to work.

### Create the connection string

The obdc driver must be installed to make this work. The credentials reference a windows virtual machine running within a linux host computer.

In [28]:
engine = create_engine('mssql+pyodbc://Windows-10\SQLEXPRESS/GBD?driver=SQL+Server')

In [29]:
pyodbc.drivers()

['SQL Server',
 'SQL Server Native Client RDA 11.0',
 'ODBC Driver 17 for SQL Server',
 'Microsoft Access Driver (*.mdb, *.accdb)',
 'Microsoft Excel Driver (*.xls, *.xlsx, *.xlsm, *.xlsb)',
 'Microsoft Access Text Driver (*.txt, *.csv)']

In [30]:
conn = engine.connect()
print('Connected!')

Connected!

In [31]:
pyodbc.dataSources()

{'MS Access Database': 'Microsoft Access Driver (*.mdb, *.accdb)',
 'Excel Files': 'Microsoft Excel Driver (*.xls, *.xlsx, *.xlsm, *.xlsb)'}

In [37]:
%%sql mssql+pyodbc://Windows-10\SQLEXPRESS/GBD?driver=SQL+Server

SELECT DISTINCT(cause) AS cause
FROM causes
ORDER BY cause ASC

Done.

[(297,),
 (298,),
 (302,),
 (321,),
 (322,),
 (328,),
 (329,),
 (332,),
 (337,),
 (338,),
 (339,),
 (340,),
 (341,),
 (342,),
 (345,),
 (346,),
 (347,),
 (350,),
 (351,),
 (352,),
 (353,),
 (357,),
 (358,),
 (359,),
 (360,),
 (365,),
 (366,),
 (380,),
 (387,),
 (391,),
 (393,),
 (400,),
 (408,),
 (411,),
 (414,),
 (417,),
 (423,),
 (426,),
 (429,),
 (432,),
 (435,),
 (438,),
 (441,),
 (444,),
 (447,),
 (450,),
 (453,),
 (456,),
 (459,),
 (462,),
 (465,),
 (468,),
 (471,),
 (474,),
 (477,),
 (480,),
 (483,),
 (484,),
 (485,),
 (486,),
 (487,),
 (490,),
 (492,),
 (493,),
 (494,),
 (498,),
 (499,),
 (500,),
 (501,),
 (502,),
 (503,),
 (504,),
 (509,),
 (510,),
 (515,),
 (516,),
 (520,),
 (521,),
 (529,),
 (530,),
 (531,),
 (532,),
 (533,),
 (534,),
 (535,),
 (541,),
 (543,),
 (544,),
 (545,),
 (546,),
 (554,),
 (557,),
 (560,),
 (561,),
 (572,),
 (587,),
 (588,),
 (589,),
 (594,),
 (603,),
 (613,),
 (619,),
 (627,),
 (639,),
 (641,),
 (665,),
 (668,),
 (686,),
 (689,),
 (695,),
 (697,),
 (698,),
 (699,),
 (700,),
 (704,),
 (708,),
 (709,),
 (712,),
 (716,),
 (718,),
 (724,),
 (729,),
 (842,),
 (843,),
 (854,),
 (935,),
 (945,),
 (958,),
 (959,),
 (980,),
 (992,),
 (1022,),
 (1023,)]

### Select the top 10

In [35]:
%%sql 

SELECT TOP 10 * 
FROM causes

#diff

 * mssql+pyodbc://Windows-10\SQLEXPRESS/GBD?driver=SQL+Server
Done.

[(1, 51, 1, 28, 520, 1, 2010, 0.0, 0.0, 0.0),
 (1, 51, 2, 28, 520, 1, 2010, 0.0, 0.0, 0.0),
 (1, 51, 1, 30, 520, 1, 2010, 1.7984070777893066, 4.949845314025879, 1.3105658292770386),
 (1, 51, 2, 30, 520, 1, 2010, 2.7558300495147705, 6.83079719543457, 1.7773444652557373),
 (1, 51, 1, 31, 520, 1, 2010, 1.2737950086593628, 3.0925118923187256, 0.9484407901763916),
 (1, 51, 2, 31, 520, 1, 2010, 2.868278980255127, 7.565248966217041, 1.8214061260223389),
 (1, 51, 1, 32, 520, 1, 2010, 1.0159968137741089, 1.2909469604492188, 0.6816396713256836),
 (1, 51, 2, 32, 520, 1, 2010, 1.8282191753387451, 3.8931028842926025, 1.143686056137085),
 (1, 51, 1, 37, 520, 1, 2010, 27.653823852539062, 73.91763305664062, 22.006675720214844),
 (1, 51, 2, 37, 520, 1, 2010, 22.19183921813965, 56.39546203613281, 15.032441139221191)]

### Use GROUP BY to aggregate data

In [ ]:
%%sql

SELECT sex, sum(val)
FROM causes
GROUP BY sex

### Filter using WHERE and a CONDITIONAL

In [ ]:
%%sql

SELECT TOP 10 location, val
FROM causes
WHERE val < 10 AND val > 8
ORDER BY val DESC

### Perform a LEFT JOIN on multiple fields

In [ ]:
%%sql

SELECT TOP 10 cau.*, cause_name, age_group_name, sex_label
FROM causes cau
LEFT JOIN cause_id cid ON cid.cause_id = cau.cause
LEFT JOIN age_id age ON age.age_group_id = cau.age
LEFT JOIN sex_id sex ON sex.sex_id = cau.sex

### Use BETWEEN to limit the number of CONDITIONAL statements

In [10]:
%%sql

SELECT TOP 10 cid.cause_name, sum(val) as val
FROM causes AS cau
LEFT JOIN cause_id AS cid ON cid.cause_id = cau.cause
LEFT JOIN age_id AS age ON age.age_group_id = cau.age
LEFT JOIN sex_id AS sex ON sex.sex_id = cau.sex
WHERE cau.year = 2019 AND age.age_group_id BETWEEN 2 AND 21
GROUP BY cid.cause_name
ORDER BY val DESC

# The 'AS' clauses are not necessary, but they make the code more readable
# The BETWEEN statement is inclusive, so 2 and 21 are included in the query.

UsageError: Cell magic `%%sql` not found.

### Use PARENTHESES in CONDITIONAL statements

In [ ]:
%%sql

SELECT TOP 50 cau.*, cause_name, age_group_name, sex_label
FROM causes cau
LEFT JOIN cause_id cid ON cid.cause_id = cau.cause
LEFT JOIN age_id age ON age.age_group_id = cau.age
LEFT JOIN sex_id sex ON sex.sex_id = cau.sex
WHERE (cause = 520 OR cause = 3) AND age = 3

In this case, the parentheses change the logic so that the OR operator is evaluated before the AND operator. Without them, AND would be evaluated before OR, in effect meaning that cause = 3 and age = 3 would be grouped together, and cause = 520 would be evaluated alone. 

<a href='https://learn.microsoft.com/en-us/sql/t-sql/language-elements/operator-precedence-transact-sql?view=sql-server-ver16'>Here</a> is the order of operations for T-SQL.

### Create a VIEW

In [11]:
%%sql

CREATE VIEW temp_view
AS
SELECT TOP 10 * 
FROM causes

UsageError: Cell magic `%%sql` not found.

### Alter a VIEW

In [ ]:
%%sql

ALTER VIEW temp_view
AS
SELECT TOP 50 * 
FROM causes

This effectively overwrites the view.

### DROP a VIEW

In [ ]:
%%sql

DROP VIEW temp_view

### CREATE a TABLE using SQL

In [ ]:
%%sql

CREATE TABLE temp_table 
(
	column1 varchar(10),
	column2 varchar(10),
	column3 float
)

# column names are followed by data types

### INSERT VALUES INTO TABLE

In [ ]:
%%sql

INSERT INTO temp_table (column1, column2, column3)
VALUES 
	('a','b', 1.1),
    ('c','d', 2.2),
    ('e','f', 3.3)

# make sure that the text has quotes

### CREATE a TABLE from an existing TABLE

In [ ]:
%%sql

SELECT TOP 10 *
INTO temporary_table
FROM causes

#diff

### INSERT values from one table INTO another

In [19]:
%%sql

INSERT INTO causes
SELECT * FROM causes_for_insertion

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

### CREATE COLUMNS using ALTER TABLE

In [ ]:
%%sql

ALTER TABLE temporary_table
ADD rounded float, 
    times3 float, 
    over2 float

### Add values to COLUMNS using UPDATE and SET

In [ ]:
%%sql

UPDATE temporary_table
SET rounded = ROUND(VAL,2), 
	times3 = val*3, 
	over2 = val/2

### DROP COLUMNS

In [ ]:
%%sql

ALTER TABLE temporary_table
DROP COLUMN rounded, 
            times3, 
            over2

### DROP TABLE

In [12]:
%%sql

DROP TABLE temp_table;
DROP TABLE temporary_table

# contains 2 separate commands separated by semi-colon

UsageError: Cell magic `%%sql` not found.

### Replace NULL values using UPDATE and SET

In [9]:
%%sql

UPDATE temporary_table
SET measure_id = 0
WHERE measure_id IS NULL

UsageError: Cell magic `%%sql` not found.

### DELETE table values

In [ ]:
%%sql

DELETE FROM temporary_table
WHERE measure_id = 0

### Use LIKE to find numbers that are approximate to the given value

In [ ]:
%%sql

SELECT *
FROM causes
WHERE val LIKE 345

### Use an ALIAS column

In [ ]:
%%sql

SELECT AVG(val) AS average
FROM causes

### Use a SUBQUERY

## Additional Differences between Standard SQL and T-SQL

https://learnsql.com/blog/14-differences-sql-vs-tsql/

### Naming Conventions

In T-SQL, brackets can be used to designate tables, views, and columns with spacces or special characters. Quotation marks can also be used as is done in standard SQL.

In [ ]:
%%sql 

SELECT [Cause ID]
FROM cause_hier

### Returns

T-SQL can return values without a reference to a table.

In [18]:
%%sql

SELECT 27/9

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

### LIMITS

T-SQL, uses a different syntax to limit the number of rows displayed. Either 'TOP' can be used, as was exemplified earlier, or this syntax below. OFFSET is required for the query to run. It designates the number of rows to skip before displaying the results. ORDER BY is also required.

In [ ]:
%%sql

SELECT *
FROM causes
ORDER BY cause OFFSET 0 ROWS FETCH FIRST 10 ROWS ONLY

In [ ]:
%%sql

-- equivalent syntax using top:

SELECT TOP 10 *
FROM causes

### IDENTITY Column

SQL can be used to create columns that are automatically populated with values.

In [ ]:
%%sql

--Standard SQL syntax

CREATE TABLE testTable (id DECIMAL GENERATED ALWAYS AS IDENTITY)

In [ ]:
%%sql

--T-SQL syntax

CREATE TABLE testTable (id INTEGER IDENTITY)